# --------------------------------------------------------------------------------
# Amazon S3 構築 Terraform テンプレート アウトプット定義
# --------------------------------------------------------------------------------

# --------------------------------------------------------------------------------
# Amazon S3 Bucket アウトプット定義
# @see https://registry.terraform.io/providers/hashicorp/aws/latest/docs/resources/s3_bucket
# --------------------------------------------------------------------------------

output "s3_bucket" {
  value = aws_s3_bucket.this
}